// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет. Решаем с помощью "/" и "%", со строками не работаем (Максимальное число 100000)

// 645 -> 5

// 78 -> третьей цифры нет

// 32679 -> 6

//=================================================================================================================================================================================

//Решение:

// int numRandom = new Random().Next(100000);
// int resultThird = numRandom;

// if (numRandom < 100){
//     Console.WriteLine("третьей цифры нет");
// } else {
//     while (resultThird > 1000){
//         resultThird /= 10;
//     }
//     resultThird %= 10;
// }

// Console.WriteLine(numRandom);
// Console.WriteLine(resultThird);

//=================================================================================================================================================================================