// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. Решаем с помощью "/" и "%", со строками не работаем

// 456 -> 5
// 782 -> 8
// 918 -> 1

//=================================================================================================================================================================================

//Решение:

// int numRandom = new Random().Next(100,1000);

// int resultSecond = numRandom / 10 % 10;

// Console.WriteLine(numRandom);
// Console.WriteLine(resultSecond);

//=================================================================================================================================================================================