// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным. Обязательно сделать проверку на ввод чисел меньше 1 и больше 7

// 6 -> да
// 7 -> да
// 1 -> нет

//=================================================================================================================================================================================

//Решение:

// Console.WriteLine("Введите, какой день недели сегодня, от 1 до 7: ");
// int dayWeek = int.Parse(Console.ReadLine()!);
// int min = 1;
// int max = 7;

// if (dayWeek < min){
//     Console.WriteLine("День недели не может быть меньше " + min + ".");
// } else if (dayWeek > max){
//     Console.WriteLine("В неделе " + max + " дней.");
// } else if ((dayWeek == 6) || (dayWeek == 7)){
//     Console.WriteLine("Сегодня выходной");
// } else {
//     Console.WriteLine("Сегодня будний день недели");
// }

//=================================================================================================================================================================================